
#Область ПрограммныйИнтерфейс
//++Романов ДЗ13_2 04.11.2024 
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаИКомандуПересчитатьТаблицуВГруппаШапкаЛево(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры
//--
#КонецОбласти

#Область ПрограммныйИнтерфейс
//++Романов ДЗ13_2 04.11.2024 
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	Элемент = Форма.Элементы.Вставить("КонтактноеЛицо", Тип ("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма)

	Элемент = Форма.Элементы.Вставить("КонтактноеЛицо", Тип ("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.КонтактноеЛицо";
    
КонецПроцедуры


Процедура ДобавитьПолеКонтактноеЛицоПередОснование(Форма)

	Элемент = Форма.Элементы.Вставить("КонтактноеЛицо", Тип ("ПолеФормы"), , Форма.Элементы.Основание);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.КонтактноеЛицо";
    
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаИКомандуПересчитатьТаблицуВГруппаШапкаЛево(Форма)
	
	Группа = Форма.Элементы.Вставить("ГруппаСкидка", Тип ("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "";
	
	Элемент = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Группа);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.СогласованнаяСкидка";
	Элемент.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");    
	
	Команда = Форма.Команды.Добавить ("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать Таблицу";
	Команда.Действие = "ПересчитатьТаблицу";
	
	КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитатьТаблицу", Тип ("КнопкаФормы"), Группа);
	КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	
	КнопкаФормы.Картинка = БиблиотекаКартинок.Обновить;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
        
КонецПроцедуры
//--
#КонецОбласти



